#1.创建有数据的集合
# s1 = {10,20,30,40,50}
# print(s1)
#集合是无序的
# s2 = {10,30,20,10,30,40,50,50}
# print(s2)
# #集合中没有相同的元素
#
# s3 = set("abcedef")
# print(s3)
#
# #2创建空集合
# s4 = set()
# print(s4)
# print(type(s4))
# s5 = {} #这个是字典
# print(type(s5))
#
# #2.1增加数据 add()  update()
# # 集合是可变类型
# s6 = {10,20}
# s6.add(100)
# s6.add(10)
# print(s6)
# #集合有去重功能，如果追加的数据是集合已有数据，则什么都不做
# #不能添加序列，否则会报错
# s6.update([10,20,30,40]) #如果追加单一元素，则报错。
# print(s6)
# #删除数据 remove()删除指定数据，如不存在则报错
# #discard() 删除指定数据，如果数据不存在不报错

# pop() 随机删除某个数据，并返回这个数据

#2.3 查找数据
#in not in
s7 = {10,20,30,40}
print(10 in s7)
print(10 not in s7)
